; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=36, remove_proportion=0.2, bases=7, instance_id=21, output=./training, seed=62

(define (problem warehouse-21)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 - box
        base1 base2 base3 base4 base5 base6 base7 - base
    )
    (:init
        (to-remove box5)
        (to-remove box12)
        (to-remove box16)
        (to-remove box20)
        (to-remove box22)
        (to-remove box29)
        (to-remove box30)
        (clear box26)
        (on box26 box31)
        (on box31 box11)
        (on box11 box12)
        (on box12 box6)
        (on box6 box16)
        (on-base box16 base1)
        (clear box24)
        (on box24 box9)
        (on box9 box2)
        (on box2 box5)
        (on box5 box22)
        (on box22 box4)
        (on-base box4 base2)
        (clear box27)
        (on box27 box19)
        (on box19 box36)
        (on box36 box7)
        (on box7 box1)
        (on box1 box35)
        (on box35 box34)
        (on-base box34 base3)
        (clear box33)
        (on box33 box29)
        (on box29 box13)
        (on box13 box14)
        (on-base box14 base4)
        (clear box3)
        (on box3 box30)
        (on box30 box15)
        (on box15 box28)
        (on box28 box20)
        (on box20 box32)
        (on-base box32 base5)
        (clear box23)
        (on box23 box8)
        (on box8 box25)
        (on box25 box21)
        (on-base box21 base6)
        (clear box18)
        (on box18 box10)
        (on box10 box17)
        (on-base box17 base7)
    )
    (:goal (and 
        (removed box5)
        (removed box12)
        (removed box16)
        (removed box20)
        (removed box22)
        (removed box29)
        (removed box30)
    ))
)

; plan
1. (move box24 box9 box18)
   deleted: (clear box18) (on box24 box9)
   added: (on box24 box18) (clear box9)
   goals met: 0 of 7
2. (move box26 box31 box23)
   deleted: (clear box23) (on box26 box31)
   added: (on box26 box23) (clear box31)
   goals met: 0 of 7
3. (move box3 box30 box24)
   deleted: (clear box24) (on box3 box30)
   added: (on box3 box24) (clear box30)
   goals met: 0 of 7
4. (move box31 box11 box26)
   deleted: (clear box26) (on box31 box11)
   added: (on box31 box26) (clear box11)
   goals met: 0 of 7
5. (move box11 box12 box27)
   deleted: (clear box27) (on box11 box12)
   added: (on box11 box27) (clear box12)
   goals met: 0 of 7
6. (move box33 box29 box11)
   deleted: (clear box11) (on box33 box29)
   added: (on box33 box11) (clear box29)
   goals met: 0 of 7
7. (remove box12 box6)
   deleted: (on box12 box6) (clear box12)
   added: (removed box12) (clear box6)
   goals met: 1 of 7
8. (remove box29 box13)
   deleted: (on box29 box13) (clear box29)
   added: (removed box29) (clear box13)
   goals met: 2 of 7
9. (move box6 box16 box13)
   deleted: (clear box13) (on box6 box16)
   added: (on box6 box13) (clear box16)
   goals met: 2 of 7
10. (remove-from-base box16 base1)
   deleted: (on-base box16 base1) (clear box16)
   added: (removed box16) (clear-base base1)
   goals met: 3 of 7
11. (move box9 box2 box3)
   deleted: (clear box3) (on box9 box2)
   added: (on box9 box3) (clear box2)
   goals met: 3 of 7
12. (remove box30 box15)
   deleted: (on box30 box15) (clear box30)
   added: (removed box30) (clear box15)
   goals met: 4 of 7
13. (move box2 box5 box15)
   deleted: (clear box15) (on box2 box5)
   added: (on box2 box15) (clear box5)
   goals met: 4 of 7
14. (move box2 box15 box31)
   deleted: (clear box31) (on box2 box15)
   added: (on box2 box31) (clear box15)
   goals met: 4 of 7
15. (move box15 box28 box2)
   deleted: (clear box2) (on box15 box28)
   added: (on box15 box2) (clear box28)
   goals met: 4 of 7
16. (move box28 box20 box15)
   deleted: (clear box15) (on box28 box20)
   added: (on box28 box15) (clear box20)
   goals met: 4 of 7
17. (remove box20 box32)
   deleted: (on box20 box32) (clear box20)
   added: (removed box20) (clear box32)
   goals met: 5 of 7
18. (remove box5 box22)
   deleted: (on box5 box22) (clear box5)
   added: (removed box5) (clear box22)
   goals met: 6 of 7
19. (remove box22 box4)
   deleted: (on box22 box4) (clear box22)
   added: (removed box22) (clear box4)
   goals met: 7 of 7
